# this will probably be installed manually
tap 'thoughtbot/formulae'
tap 'wallix/awless'
brew 'rcm'
brew 'mas'
brew 'awless'

tap 'caskroom/cask'
tap 'Homebrew/bundle'

cask 'visual-studio-code'
cask 'google-chrome'
cask 'firefox-developer-edition'
cask 'alfred'
cask 'alacritty'
cask 'transmit'
cask 'hyper'
cask 'spotify'
cask 'phoenix'
cask 'kaleidoscope'
cask 'permute'
cask 'vlc'
cask 'ngrok'
cask 'sequel-pro'
cask 'spotify'
cask '1password'
cask 'now'
cask 'spectrum'
cask 'postman'
cask 'imageoptim'
cask 'dash'
cask 'fork'
cask 'figma'
cask 'station'
cask 'pgadmin4'

cask 'font-anonymous-pro'
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'font-space-mono'
cask 'font-source-code-pro'
cask 'font-roboto-mono'

# editor of the ages
brew 'vim'
brew 'nvim'

# markdown
brew 'markdown'

# version manager
brew 'asdf'

# lscolors
brew 'exa'

# ctags
brew 'ctags'

# spotifyd
brew 'Spotifyd/tap/spotifyd'

# fuzzy finder searching
brew 'fzf'
brew 'the_silver_searcher' #ag
brew 'fd'
brew 'ripgrep' # rp

# foreman for go
brew 'forego'

# directory based .env files
brew 'autoenv'

# install docker
cask 'docker'
brew 'docker-machine'
brew 'docker-compose'

# version control
brew 'git'
brew 'git-delta'

# better git logs
brew 'tig'
brew 'pre-commit'

# pgp
brew 'gpg'
cask 'keybase'

# diff in pretty colors
brew 'colordiff'

# install golang
brew 'go'
brew 'glide'

# github bindings in git
brew 'hub'
brew 'github/gh/gh'

# go static site generator
brew 'hugo'

# sed for json
brew 'jq'

# install openssl
brew 'openssl'

# tool for installed keys onto remote servers
brew 'ssh-copy-id'

# zsh syntax highlighting
brew 'zsh'
brew 'zsh-syntax-highlighting'

# infrastructure as code
brew 'terraform'
brew 'terraform-docs'
brew 'packer'

# terminal multiplexer
brew 'tmux'

# run the output of commands
brew 'watch'
brew 'watchman'

# cli based browser
brew 'wget'

brew 'ffmpeg'

# Install Apps from the MAC
mas 'Deliveries'           , id: 924726344
mas 'Day One'              , id: 1055511498
mas 'Calcbot'              , id: 931657367
mas 'Xcode'                , id: 497799835
mas 'Reeder'               , id: 880001334
mas 'Things 3'             , id: 904280696
mas 'Spark'                , id: 1176895641
mas 'Tweetbot 3'           , id: 1384080005

