# this will probably be installed manually
tap 'thoughtbot/formulae'
tap 'wallix/awless'
brew 'rcm'
brew 'mas'
brew 'awless'

tap 'caskroom/cask'
tap 'Homebrew/bundle'

cask 'visual-studio-code'
cask 'google-chrome'
cask 'firefox'
cask 'alfred'
cask 'iterm2'
cask 'transmit'
cask 'istat-menus'
cask 'hyper'
cask 'spotify'
cask 'phoenix'
cask 'graphiql'
cask 'bitbar'
cask 'dropshare'
cask 'kaleidoscope'
cask 'permute'
cask 'vlc'
cask 'ngrok'
cask 'sequel-pro'
cask 'spotify'
cask '1password'
cask 'now'
cask 'spectrum'
cask 'postman'
cask 'imageoptim'
cask 'android-studio'

# editor of the ages
brew 'vim'

# markdown
brew 'markdown'

# version manager
brew 'nvm'
brew 'yarn'
brew 'rbenv'

# ctags
brew 'ctags'

# fuzzy finder searching
brew 'fzf'
brew 'the_silver_searcher'
brew 'fd'

# foreman for go
brew 'go'
brew 'forego'

# directory based .env files
brew 'autoenv'

# install docker
cask 'docker'
brew 'docker-machine'
brew 'docker-compose'

# version control
brew 'git'

# better git logs
brew 'tig'

# pgp
brew 'gpg'
cask 'keybase'

# diff in pretty colors
brew 'colordiff'

# install golang
brew 'go'
brew 'glide'

# github bindings in git
brew 'hub'

# go static site generator
brew 'hugo'

# sed for json
brew 'jq'

# install openssl
brew 'openssl'

# tool for installed keys onto remote servers
brew 'ssh-copy-id'

# zsh syntax highlighting
brew 'zsh'
brew 'zsh-syntax-highlighting'

# font
brew 'homebrew/cask-fonts/font-fira-code'

# infrastructure as code
brew 'terraform'
brew 'packer'

# terminal multiplexer
brew 'tmux'

# run the output of commands
brew 'watch'
brew 'watchman'

# cli based browser
brew 'wget'

brew 'python3'

# Install Apps from the MAC
mas 'Pixelmator'           , id: 407963104
mas 'Deliveries'           , id: 924726344
mas 'Day One'              , id: 1055511498
mas 'Helium'               , id: 1054607607
mas 'Calcbot'              , id: 931657367
mas 'Xcode'                , id: 497799835
mas 'Reeder'               , id: 880001334
mas 'Things 3'             , id: 904280696
mas 'Slack'                , id: 803453959
mas 'Spark'                , id: 1176895641
mas 'Tweetbot 3'           , id: 1384080005
mas 'Ulysses'              , id: 1225570693
mas 'Fantastical 2'        , id: 975937182

